{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "21b8ebfc",
   "metadata": {},
   "source": [
    "# Neo4j as a Traceability Solution\n",
    "In this notebook I will demonstrate why graph database Neo4j is a great candidate for the storage of manufacturing data when we want to trace all the processes from procurement of raw materials to production, consumption and disposal via a practical example.\n",
    "\n",
    "Some basic knowledge of neo4j, python and mySQL is assumed here, but it is possible to follow along without this knowledge.\n",
    "## Preparation of the example database\n",
    "In the practical example we take a look at data for an imaginary bread distribution process. Farmers produce grain, that is processed to flour by processors, further baked to bread by bakers and then distributed to bread machines where customers can make purchases.\n",
    "\n",
    "A Neo4j and mySQL instance in a docker container will be populated with this data by running the docker-compose.yml\n",
    "\n",
    "When this is done (some 60 seconds after docker-compose up), we can connect to the databases via python. Make sure py2neo, sqlalchemy and pandas are installed in the conda environment.\n",
    "\n",
    "We run a testQuery on both databases to make sure everything is working correctly."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "14826c4b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "   numberOfPurchases\n",
      "0              10000\n",
      "\n",
      "   numberOfPurchases\n",
      "0              10000\n"
     ]
    }
   ],
   "source": [
    "import py2neo\n",
    "import sqlalchemy as sql\n",
    "import pandas as pd\n",
    "\n",
    "graph = py2neo.Graph(\n",
    "    host=\"localhost\",\n",
    "    port=7687,\n",
    "    user=\"neo4j\",\n",
    "    password=\"connect\",\n",
    "    name=\"neo4j\"\n",
    ")\n",
    "\n",
    "df1 = pd.DataFrame(graph.run(\"MATCH (a:Purchase) RETURN count(a) as numberOfPurchases\").data())\n",
    "print(df1)\n",
    "\n",
    "db_connection_str = 'mysql+pymysql://root:debezium@localhost:3306/traceability'\n",
    "db_connection = sql.create_engine(db_connection_str)\n",
    "\n",
    "df2 = pd.read_sql('SELECT count(*) as numberOfPurchases FROM Buy', con=db_connection)\n",
    "print(\"\")\n",
    "print(df2)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e93430dc",
   "metadata": {},
   "source": [
    "The previous queries should both yield 10000, as the datagenerator in docker-compose explicitly generates 10000 purchases. Now that we know everythin is up and running we can compare some queries to showcase the power and flexibility of neo4j in the context of deeply nested data.\n",
    "## first Query scenario\n",
    "Let's imagine the scenario where there is Nuclear waste buried in the ground some place. The place was deserted and a farmer saw his opportunity to grow grains in the empty soil there. Grainbatch 0 was harvested there and processed all the way to bread that got distributed and sold. We now want to find all of the customers that bought bread originating from Grainbatch 0 to prevent them from eating the contaminated bread.\n",
    "\n",
    "In Neo4j, we do this via the following Query:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "88351c8a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of distinct affected customers:\n",
      "1978\n",
      "\n",
      "Ids of 5 affected customers:\n",
      "   CustomerID\n",
      "0        4307\n",
      "1        4477\n",
      "2        2795\n",
      "3        3913\n",
      "4         152\n"
     ]
    }
   ],
   "source": [
    "df = pd.DataFrame(graph.run(\"MATCH (:Grainbatch {id:0})-[*]->(a:Customer) RETURN DISTINCT a.id as CustomerID\").data())\n",
    "print(\"Number of distinct affected customers:\")\n",
    "print(df[\"CustomerID\"].count())\n",
    "print(\"\")\n",
    "print(\"Ids of 5 affected customers:\")\n",
    "print(df.head())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c27535b0",
   "metadata": {},
   "source": [
    "We used the \"-\\[*\\]->\" in the query to signify that we want to look any path length downstream from Grainbatch 0 and find the customers there and then return all of the distinct customer ids that we found. Very simple\n",
    "\n",
    "Now let's build the same Query for the mySQL table:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "eba60a11",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of distinct affected customers:\n",
      "1978\n",
      "\n",
      "Ids of 5 affected customers:\n",
      "   CustomerID\n",
      "0        2015\n",
      "1        4515\n",
      "2         230\n",
      "3        3178\n",
      "4        1518\n"
     ]
    }
   ],
   "source": [
    "QUERY = \"\"\"SELECT DISTINCT CustomerID\n",
    "        FROM Buy\n",
    "        INNER JOIN Dist AS d\n",
    "        ON Buy.MachineBatchnr = d.Batchnr\n",
    "        INNER JOIN Bake AS b\n",
    "        ON d.BakeBatchnr = b.Batchnr\n",
    "        INNER JOIN Process as p\n",
    "        ON b.ProcessBatchnr = p.Batchnr\n",
    "        WHERE p.FarmBatchnr = 0\"\"\"\n",
    "df = pd.read_sql(QUERY, con=db_connection)\n",
    "\n",
    "print(\"Number of distinct affected customers:\")\n",
    "print(len(df))\n",
    "print(\"\")\n",
    "print(\"Ids of 5 affected customers:\")\n",
    "print(df.head())"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "18f083a4",
   "metadata": {},
   "source": [
    "This Query was clearly a lot more involved. We required 3 JOIN statements and to implement these JOINs, we have to explicitly know which tables to relate to one another (Buy relates to Dist relates to Bake relates to Process) and which columns relate the tables to eachother.\n",
    "\n",
    "## second Query scenario\n",
    "\n",
    "Imagine now a scenario where for some bread types we don't just use flour from Flourbatches, but we first refine the Flour in another process as is shown in the Figure FIGUUR MAKEN.\n",
    "\n",
    "In mySQL we would have to again explicitly know all the different ways the grainbatch get processed and consumed downstream by customers and implement all the different ways our tables have to be JOINed. This very prone to error.\n",
    "\n",
    "In Neo4j, we would have to change nothing about our previous Query. We can completely rely on the flexibility of the \"-\\[*\\]->\" query statement.\n",
    "\n",
    "## third Query scenario\n",
    "\n",
    "Customers can give ratings to their bread purchases. Imagine some purchase recieves a very bad rating. We want to Query our database to see where the bad rating comes from. Assuming the bread was rated badly for good reason, we can attempt to look upstream in our production process to check where the problem could lie.\n",
    "\n",
    "If the problem lies within the distribution process, we can imagine that a lot of the purchases downstream from this distribution process have a bad rating. If the problem lies with the baking process, we can imagine that that a lot of the purchases downstream from this baking process have a bad rating (this necessarily implies a lot of the purchases downstream from the distribution process have a bad rating as well, since the distribution process lies downstream from the bad bakin process).\n",
    "A similar reasoning goes for the processing process and the harvesting process.\n",
    "\n",
    "So what we want to do is query upstream from bad purchase to find its parent distribution, baking, processing and harvesting process and from these processes check back downstream for all their respective child purchases and check the ratio of bad ratings on these purchases.\n",
    "\n",
    "First an auxiliary query is necessary to find a suitable badly rated purchase for this example (Using neo4j for this :) ):"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "2c560dac",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Suitable badly rated Purchase found with ID:\n",
      "203\n"
     ]
    }
   ],
   "source": [
    "#find a flourbatch with a lot of badly rated children\n",
    "Query = \"\"\"MATCH (a:Flourbatch)-[*]->(b:Purchase) \n",
    "        WITH a, collect(b) as allPurchases \n",
    "        WITH size([x in allPurchases where x.goodrating = false]) as top,\n",
    "            size(allPurchases)*1.0 as bottom, allPurchases\n",
    "        WHERE top/bottom > 0.8 RETURN allPurchases[0].id as CustomerID\"\"\"\n",
    "\n",
    "badPurchaseID = graph.run(Query).data()[0][\"CustomerID\"]\n",
    "print(\"Suitable badly rated Purchase found with ID:\")\n",
    "print(badPurchaseID)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8f742fc1",
   "metadata": {},
   "source": [
    "Now we utilise neo4j to Query for the above scenario using badly rated purchase that we found in the auxiliary Query:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "c857fd35",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "      batchType  batchID badratingPercentage\n",
      "0    Grainbatch        0                 30%\n",
      "1    Flourbatch        1                 91%\n",
      "2    Breadbatch        5                 93%\n",
      "3  Machinebatch       29                 95%\n"
     ]
    }
   ],
   "source": [
    "Query = f\"\"\"UNWIND ['Grainbatch','Flourbatch','Breadbatch','Machinebatch'] AS y\n",
    "        match (:Purchase {{id:{badPurchaseID}}})<-[*]-(a) where labels(a)=[y] WITH a,y\n",
    "        MATCH (a)-[*]->(b:Purchase) WITH a.id AS batchID, collect(b) AS allPurchases, y\n",
    "        WITH batchID, y,\n",
    "            size([x in allPurchases where x.goodrating = false]) as top,\n",
    "            size(allPurchases)*1.0 as bottom\n",
    "        RETURN y as batchType, batchID, top/bottom as badratingPercentage\"\"\"\n",
    "\n",
    "df = pd.DataFrame(graph.run(Query).data())\n",
    "df[\"badratingPercentage\"] = df[\"badratingPercentage\"].map(\"{:.0%}\".format)\n",
    "print(df)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7df86723",
   "metadata": {},
   "source": [
    "We find that the flourbatch, breadbatch and machinebatch all have a lot of badly rated purchases as children. Since the flourbatch is the highest in the parent-child relation, we find that the problem lies with the flourbatch and we should contact the flour processing firm that made the flourbatch.\n",
    "\n",
    "The Neo4j query above is a bit more involved than just the \"-\\[\\*\\]->\" that we used previously, but for what the query ended up doing it's still very compact and again very flexible through the use of the \"-\\[\\*\\]->\" statement.\n",
    "\n",
    "Now let's try to build this same query in mySQL (wish me luck):"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3dbafaa2",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
